app/Controllers/Frontend/Accountcontroller.php

    public function index()
    {
        $configuration = new ConfigurationModel();
        $social_media = new SocialMediaModel();
        $product_category = new ProductCategoryModel();

        $data['configuration'] = $configuration->get()->getFirstRow();
        $data['social_medias'] = $social_media->get()->getResult();
        $data['product_categories'] = $product_category->get()->getResult();
---
SELECT *
FROM `configuration`
SELECT *
FROM `social_media`
SELECT *
FROM `product_category`