app/Controllers/Frontend/Cartcontroller.php

SELECT *
FROM `configuration`
SELECT *
FROM `social_media`
SELECT *
FROM `product_category`
---
    public function index()
    {
        $configuration = new ConfigurationModel();
        $social_media = new SocialMediaModel();
        $product_category = new ProductCategoryModel();
        $cart_product = new CartModel();

        $data['configuration'] = $configuration->get()->getFirstRow();
        $data['social_medias'] = $social_media->get()->getResult();
        $data['product_categories'] = $product_category->get()->getResult();