app/Controllers/Frontend/Homecontroller.php

SELECT *
FROM `configuration`
SELECT *
FROM `social_media`
SELECT *
FROM `category`
SELECT *
FROM `product_category`
SELECT *
FROM `guarantee`
SELECT *
FROM `slider`
SELECT *
FROM `promotion`
SELECT *
FROM `product`
JOIN `product_category` ON `product_category`.`id` = `product`.`category_id`
WHERE `product`.`is_featured` = 1
AND `product`.`status` = 1
SELECT *
FROM `product`
JOIN `product_category` ON `product_category`.`id` = `product`.`category_id`
WHERE `product`.`is_new_arrival` = 1
AND `product`.`status` = 1
SELECT *
FROM `banner`
SELECT *
FROM `support`
SELECT *
FROM `exclusive`
SELECT *
FROM `brand`
SELECT *
FROM `blog`
SELECT *
FROM `product`
WHERE `product`.`status` = 1
---
    public function index()
    {
        $configuration = new ConfigurationModel();
        $social_media = new SocialMediaModel();
        $product_category = new ProductCategoryModel();

        $data['configuration'] = $configuration->get()->getFirstRow();
        $data['social_medias'] = $social_media->get()->getResult();
        $data['product_categories'] = $product_category->get()->getResult();

        $db = \Config\Database::connect();
        $data['guarantee'] = $db->table('guarantee')->get()->getResult();
        $data['sliders'] = $db->table('slider')->get()->getResult();
        $data['promotions'] = $db->table('promotion')->get()->getResult();
        $data['featured_products'] = $db->table('product')->where('product.is_featured', 1)->where('product.status', 1)->join('product_category', 'product_category.id = product.category_id')->get()->getResult();
        $data['new_arrival_products'] = $db->table('product')->where('product.is_new_arrival', 1)->where('product.status', 1)->join('product_category', 'product_category.id = product.category_id')->get()->getResult();
        $data['banner'] = $db->table('banner')->get()->getFirstRow();
        $data['supports'] = $db->table('support')->get()->getResult();
        $data['exclusive'] = $db->table('exclusive')->get()->getFirstRow();
        $data['brands'] = $db->table('brand')->get()->getResult();
        $data['blogs'] = $db->table('blog')->get()->getResult();
        $data['best_selling_products'] = $db->table('product')->where('product.status', 1)->get()->getResult();
        $data['top_rated_products'] = $db->table('product')->where('product.status', 1)->get()->getResult();