app/Controllers/Frontend/Ordercontroller.php

SELECT *
FROM `configuration`
SELECT *
FROM `social_media`
SELECT *
FROM `product_category`
SELECT *
FROM `order`
WHERE `order_number` = 'ORD592197156'
AND `user_id` = 'a98b3ec0-8b84-11ed-af90-b0227a7395f6'
---
    public function confirmation()
    {
        $configuration = new ConfigurationModel();
        $social_media = new SocialMediaModel();
        $product_category = new ProductCategoryModel();
        $cart = new CartModel();

        $data['configuration'] = $configuration->get()->getFirstRow();
        $data['social_medias'] = $social_media->get()->getResult();
        $data['product_categories'] = $product_category->get()->getResult();
        $data['count_cart'] = $cart->where('user_id', session()->get('id'))->countAll();

        $order = new OrderModel();
        $db = \Config\Database::connect();
        $order_number = session()->get('order_number');
        $user_id = session()->get('id');
        $data['order'] = $order->where('order_number', $order_number)->where('user_id', $user_id)->get()->getFirstRow();

SELECT *
FROM `user`
WHERE `id` = 'a98b3ec0-8b84-11ed-af90-b0227a7395f6'
---

        // account
        $account_model = new UserModel();
        $data['account'] = $account_model->where('id', session()->get('id'))->get()->getFirstRow();