app/Controllers/Extranet/Bannercontroller.php

    public function index()
    {
        $banner = new BannerModel();
        $data['banner'] = $banner->get()->getFirstRow();
---
SELECT *
FROM `banner`