app/Controllers/Extranet/Billcontroller.php

SELECT *
FROM `bill`
ORDER BY `created_at` ASC
---
    public function index()
    {
        $bill = new BillModel();
        $data['bills'] = $bill->orderBy('created_at', 'ASC')->get()->getResult();