app/Controllers/Extranet/Configurationcontroller.php

SELECT *
FROM `configuration`
---
    public function index()
    {
        $configuration = new ConfigurationModel();
        $data['configuration'] = $configuration->get()->getFirstRow();