app/Controllers/Extranet/Extranethomecontroller.php

SELECT COUNT(*) AS `numrows` FROM `order`
---
    public function index()
    {
        $order = new OrderModel();
        $customer = new UserModel();

        $data['count_order'] = $order->countAll();