app/Controllers/Extranet/Faqcontroller.php

SELECT *
FROM `faq`
ORDER BY `created_at` ASC
---
    public function index()
    {
        $faq = new FaqModel();
        $data['faqs'] = $faq->orderBy('created_at', 'ASC')->get()->getResult();