app/Controllers/Extranet/Productcategorycontroller.php

    public function index()
    {
        $product_category = new ProductCategoryModel();
        $data['product_categories'] = $product_category->get()->getResult();
---
SELECT *
FROM `product_category`