app/Controllers/Extranet/Productcontroller.php

    public function index()
    {
        $product = new ProductModel();
        $data['products'] = $product->get()->getResult();
---
SELECT *
FROM `product`

    public function edit($id)
    {
        $product_category = new ProductCategoryModel();
        $data['product_categories'] = $product_category->where('status', 1)->get()->getResult();
---
SELECT *
FROM `product_category`
WHERE `status` = 1