app/Controllers/Extranet/Socialmediacontroller.php

    public function index()
    {
        $social_media = new SocialMediaModel();
        $data['social_medias'] = $social_media->get()->getResult();
---
SELECT *
FROM `social_media`

    public function show($id)
    {
        $social_media = new SocialMediaModel();
        $data['social_media'] = $social_media->where('id', $id)->get()->getFirstRow();
---
SELECT *
FROM `social_media`
WHERE `id` = '2355b3d7-8e50-11ed-8408-b0227a7395f6'

    public function edit($id)
    {
        $social_media = new SocialMediaModel();
        $data['social_media'] = $social_media->where('id', $id)->get()->getFirstRow();
---
SELECT *
FROM `social_media`
WHERE `id` = '2fc41762-8e50-11ed-8408-b0227a7395f6'